{
  "backend/main.mo": "IC canister implementing product, order, and config types with product filtering by style and default category listings.",
  "feature_evidence.json": "Feature evidence listing UI theme updates and affected frontend files with metadata and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each main frontend file, components, and hooks in the storefront project.",
  "frontend/index.css": "Root Tailwind CSS variables and dark‑mode values defining color tokens and base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app composing header, hero, categories, products, sections, and footer with config loading and providers.",
  "frontend/src/components/CartSheet.tsx": "Cart side‑sheet with item list, quantity controls, checkout panel toggle, and empty‑state handling.",
  "frontend/src/components/CategoryShowcase.tsx": "Category grid with icon and gradient maps enabling scroll navigation and playful card effects.",
  "frontend/src/components/CheckoutPanel.tsx": "Checkout form handling order submission, cart data, validation, and confirmation UI.",
  "frontend/src/components/FeaturedCollections.tsx": "Displays a grid of featured product collections with icons, gradients, and CTA buttons.",
  "frontend/src/components/Footer.tsx": "Footer with brand info, navigation links, social area, and smooth-scroll handlers.",
  "frontend/src/components/Hero.tsx": "Hero section showing brand visuals, headline, description, and scroll-to-products CTA.",
  "frontend/src/components/NewsletterCTA.tsx": "Newsletter signup card with email input, form handling, and stylized presentation.",
  "frontend/src/components/ProductCard.tsx": "Product display card with image, tags, price, stock badges, and actions for details and add-to-cart.",
  "frontend/src/components/ProductDetailDialog.tsx": "Modal showing detailed product info, allowing size/color selection and adding items to the cart with validation. Manages quantity, displays style tags, and handles out‑of‑stock states.",
  "frontend/src/components/ProductsSection.tsx": "Displays product listings filtered by category and style, includes quick-add-to-cart and a detail dialog. Fetches products via queries and manages UI filters and dialogs.",
  "frontend/src/components/StorefrontHeader.tsx": "Renders the storefront header with navigation, search, account button, cart access, and a mobile menu. Scrolls to sections and displays cart item count.",
  "frontend/src/components/TrustHighlights.tsx": "Shows a grid of trust/brand highlights with icons and descriptions. Static marketing section emphasizing store benefits.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity, refetching dependent queries when identity changes. Provides the actor instance and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, including login, logout, identity loading, and status tracking. Provides context for accessing identity across the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching config, products, and placing orders using the actor. Also provides helpers for style labels and available style options.",
  "frontend/src/index.css": "Defines global Tailwind layers, fonts, light/dark theme OKLCH color tokens, and some custom playful utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/state/cart.tsx": "Implements a React context for cart state with item management, quantity updates, and totals.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, fonts, radii, shadows, and plugins using CSS variables.",
  "project_state.json": "Project metadata and feature tracking for building the KSM Corporation storefront."
}