{
  "backend/main.mo": "Motoko backend defining product, category, and order types with methods for config retrieval and product creation using in‑memory maps.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of concise summaries for key frontend files and components in the project.",
  "frontend/index.css": "Tailwind base/theme CSS defining OKLCH color tokens, dark mode variables, and global styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app assembling header, hero, categories, products, and footer, with backend config fetching and fallback categories.",
  "frontend/src/components/CartSheet.tsx": "Slide‑in cart panel showing cart items, quantity controls, and checkout panel toggle.",
  "frontend/src/components/CategoryShowcase.tsx": "Renders a grid of category cards with icons, gradients, and click-to-scroll behavior for navigating to products. Includes a brand story section and dynamic icon/gradient mapping.",
  "frontend/src/components/CheckoutPanel.tsx": "Handles checkout form submission, order creation, and success display with cart clearing and error handling. Shows either the checkout form or an order confirmation view.",
  "frontend/src/components/FeaturedCollections.tsx": "Displays three predefined featured collections with icons, gradients, and buttons. Provides a styled grid of promotional collection cards.",
  "frontend/src/components/Footer.tsx": "Renders site footer with brand info, category links that scroll to products, customer service links, and social icons. Uses provided brand name and categories for dynamic content.",
  "frontend/src/components/Hero.tsx": "Shows a large hero section with brand logo, headline, description, and CTAs that scroll to specific sections. Includes decorative background images and trust indicators.",
  "frontend/src/components/NewsletterCTA.tsx": "Provides a newsletter signup form inside a styled card, capturing email input and resetting on submit. Includes decorative gradients and an icon header.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, pricing, stock indicators, style tags, and quick actions for viewing details or adding to cart.",
  "frontend/src/components/ProductDetailDialog.tsx": "Renders a dialog showing detailed product info, allowing selection of size, color, quantity, and adding the item to the cart with validation.",
  "frontend/src/components/ProductsSection.tsx": "Shows products by category with style filtering, hash-based navigation, product detail modal handling, and quick-add cart functionality.",
  "frontend/src/components/StorefrontHeader.tsx": "Provides a responsive storefront header with navigation, search/user icons, and cart access, updating category selection via URL hash.",
  "frontend/src/components/TrustHighlights.tsx": "Displays a grid of trust badges highlighting security, shipping, returns, and support benefits.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when authentication changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider managing Internet Identity auth using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching storefront config, products, and placing orders, plus helpers for RegionStyle labels and options.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables defining fonts, colors, and utility classes for the app's design system.",
  "frontend/src/main.tsx": "Application entry that initializes React, wraps the app with QueryClientProvider and InternetIdentityProvider, and loads global CSS.",
  "frontend/src/state/cart.tsx": "React context for cart state with add, remove, update quantity, clear actions, and computed item count and totals.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing app goals, features, constraints, and pending requirements for the e-commerce storefront."
}