{
  "kind": "build_request",
  "title": "Shift storefront theme toward a more blue, less pink/purple palette",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Update the storefront visual theme to use more blue tones and reduce/remove pink/purple hues across the UI while keeping the existing playful/cartoonish aesthetic and ensuring good text contrast and readability.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Can you put a little more blue color, not pinkish? ... I wanted more manly color."
        ]
      },
      "acceptanceCriteria": [
        "Global theme tokens are adjusted to emphasize blue as the primary and reduce/remove any pink/purple-leaning tones (including in light and dark mode variables).",
        "No prominent UI elements (section gradients, buttons, cards, badges, dividers) render with clearly pink/purple styling unless it is a very subtle, non-dominant accent.",
        "Text and interactive components maintain accessible contrast (no low-contrast text on gradients/backgrounds introduced by the palette change)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Replace any explicit Tailwind purple/pink gradient usages in storefront sections (e.g., featured collection cards) with blue-forward gradients that match the updated theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "put a little more blue color, not pinkish"
        ]
      },
      "acceptanceCriteria": [
        "Featured collection cards and other gradient-based UI elements no longer use purple/pink Tailwind classes (e.g., purple-*, fuchsia-*, pink-*), and are updated to blue-forward equivalents.",
        "The updated gradients look consistent with the rest of the site theme (header/hero/products sections) and do not introduce new clashing colors."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn components); only compose/override via theme tokens and app components.",
    "Keep all user-facing text in English and do not add any derogatory or inflammatory language to the UI."
  ],
  "nonGoals": [
    "No new product features, filters, checkout changes, or backend changes.",
    "No logo/image regeneration unless required by the palette change (not requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Prefer a blue-forward color palette; reduce/remove pink/purple tones."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}