{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Company storefront category cleanup and publish-ready frontend wiring",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Remove NFT/crypto-related fallback UI data and align the frontend fallback storefront categories (ids/titles/descriptions) to the physical-goods category set in English.",
      "acceptanceCriteria": [
        "The homepage does not show an “NFTs” category in fallback mode",
        "Fallback categories match the backend category set and ids used by the product listing/category filtering UI",
        "All visible labels/descriptions remain English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update `defaultConfig` to include exactly 8 physical store categories (Women’s Clothing, Men’s Clothing, Children’s Clothing, Infant Clothing, Shoes, Jewelry, Accessories, Bags) with stable kebab-case ids matching the backend (e.g., `womens-clothing`, `mens-clothing`, `childrens-clothing`, `infant-clothing`, `shoes`, `jewelry`, `accessories`, `bags`), and remove any NFT/crypto (and other unsupported) fallback categories. Ensure all fallback titles/descriptions remain English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CategoryShowcase.tsx",
          "operation": "modify",
          "description": "Remove NFT/crypto-related icon/gradient mappings and add mappings for the updated category ids (including Accessories and Bags) so fallback mode and backend-driven mode render consistent category cards without “NFTs”. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProductsSection.tsx",
          "operation": "modify",
          "description": "Adjust the ProductsSection initial selected category fallback (currently hardcoded to `men`) to use the updated category ids (prefer first category from props, otherwise default to `womens-clothing`) so category filtering works when backend config is unavailable. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure the frontend is publish-ready and supports end-to-end browsing, cart, and checkout with the updated category ids and navigation wiring.",
      "acceptanceCriteria": [
        "A clean build succeeds for both frontend and backend",
        "The published deployment loads without runtime errors",
        "A user can: open the storefront, browse categories, add an in-stock product to cart, submit checkout, and receive an order confirmation with an order id"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductsSection.tsx",
          "operation": "modify",
          "description": "Add robust navigation wiring so clicking a category (from header/footer/showcase) reliably scrolls to the products area and selects the corresponding category tab. Implement a lightweight hash-based or shared-state mechanism that maps category ids to `selectedCategory` and keeps the UI in sync (including on initial load when a hash is present). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CategoryShowcase.tsx",
          "operation": "modify",
          "description": "Update category click behavior to navigate users to the products browsing experience (rather than scrolling to the category card itself). Integrate with the ProductsSection category-selection mechanism (e.g., set location hash and scroll to `products`). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StorefrontHeader.tsx",
          "operation": "modify",
          "description": "Ensure header category navigation items work with the updated category ids and trigger the same products-section selection behavior used elsewhere (including on mobile menu). Keep user-facing labels in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Ensure footer category shortcuts use the updated category ids and trigger the shared products-section navigation/selection behavior so category browsing works consistently across the app. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CheckoutPanel.tsx",
          "operation": "modify",
          "description": "Harden checkout UX for publish readiness: preserve and display the returned order id on success (current behavior) and ensure failures are handled without runtime errors (e.g., show an English error toast/message and keep cart items intact when an order fails). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}