{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shift storefront theme to a blue-forward palette (reduce/remove pink/purple)",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Update global storefront theme tokens to emphasize blue tones, reduce/remove pink/purple hues, and maintain readable/accessible contrast in light and dark modes.",
      "acceptanceCriteria": [
        "Global theme tokens are adjusted to emphasize blue as the primary and reduce/remove any pink/purple-leaning tones (including in light and dark mode variables).",
        "No prominent UI elements (section gradients, buttons, cards, badges, dividers) render with clearly pink/purple styling unless it is a very subtle, non-dominant accent.",
        "Text and interactive components maintain accessible contrast (no low-contrast text on gradients/backgrounds introduced by the palette change)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust the OKLCH CSS variables (light and .dark) to shift neutrals away from purple hues (e.g., foreground/border/muted-foreground) and keep primary blue-forward; update any purple-leaning chart tokens to non-purple alternatives while preserving the playful/cartoonish feel and ensuring good contrast."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Align any global theme CSS variables (light and .dark) with the updated blue-forward palette so theming remains consistent if this file is used by the build; keep contrast and readability."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Review theme color token bindings to ensure the updated CSS variables map cleanly (no purple/pink hardcoding) and that alpha-enabled tokens (e.g., ring/primary/muted) still produce accessible contrast across common UI states."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Replace explicit Tailwind purple/pink gradient usages in storefront sections with blue-forward gradients consistent with the updated theme.",
      "acceptanceCriteria": [
        "Featured collection cards and other gradient-based UI elements no longer use purple/pink Tailwind classes (e.g., purple-*, fuchsia-*, pink-*), and are updated to blue-forward equivalents.",
        "The updated gradients look consistent with the rest of the site theme (header/hero/products sections) and do not introduce new clashing colors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FeaturedCollections.tsx",
          "operation": "modify",
          "description": "Replace the collection card gradient that currently uses purple Tailwind classes with a blue-forward gradient (e.g., blue/sky/cyan family) and ensure the section’s gradients remain consistent with the global theme."
        },
        {
          "path": "frontend/src/components/CategoryShowcase.tsx",
          "operation": "modify",
          "description": "Update gradientMap entries that use pink/purple Tailwind classes (e.g., women/infants) to blue-forward gradients; verify category cards still feel playful and icons remain readable on the new gradients."
        },
        {
          "path": "frontend/src/components/TrustHighlights.tsx",
          "operation": "modify",
          "description": "Update the highlight gradient that currently uses purple Tailwind classes to a blue-forward gradient, keeping consistent styling with other highlight cards and maintaining icon/text contrast."
        }
      ]
    }
  ]
}